Repository: FelixJacobi/stsbl-iserv-proxyconfig
Catalog: share/locale/*/proxyconfig.po
Languages: de

source: Module: Proxy Configuration
de: Modul: Proxykonfiguration

source: Deploy proxy server on Windows Clients
de: Proxyserver auf Windows-Clients einrichten

source: The proxy server will set with a registry patch on each Windows Login.\nFurthermore the Connection Tab in the Internet Options of Windows will be hidden with a entry in the IServ Windows Registry Patch.\nThe Firefox Package in the Software Deployment will configured to use the System Settings of Windows.
de: Der Proxyserver wird mit einem Registrypatch bei jeden Windows-Login eingerichtet.\nDesweiteren wird der Tab Verbindungen in den Internetoptionen von Windows mittels eines Eintrags im IServ Registry-Patch ausgeblendet.\nDas Firefox-Paket der Softwareverteilung wird so konfiguriert, das Firefox die Windows-Systemeinstellungen für den Proxy übernimmt.

source: Proxy server to deploy
de: Zu verteilender Proxyserver

source: The proxy server which will deployed to the Windows Clients.\nempty: Use configuration of IServ (Proxy in iservcfg)\ndirect: Configure Windows to use a direct internet connection\nauto: Try to configure Windows to use WPAD/PAC\nscript: Use the PAC script of IServ\nother: Proxy server in format hostname:port
de: Der Proxyserver, der auf den Windows-Clients eingerichtet wird.\nleer: Konfiguration von IServ nutzen (Proxy in iservcfg)\ndirect: Windows so konfigurieren, dass eine direkte Internetverbindung verwendet wird.\nauto: Windows so konfigurieren, dass PAC/WPAD verwendet wird.\nscript: Das PAC-Skript von IServ für die Konfiguration verwenden.\nanderer Wert: Proxyserver im Format hostname:port

source: Enable DMZ mode (Hamburg)
de: DMZ-Modus aktivieren (Hamburg)

source: The Firewall of the IServ will configured to allow access to the proxy from another subnets.\nEnable this to allow the access to the Proxy if the IServ is homed in a DMZ of a Time for kids-Schulrouter.
de: Die Firewall von IServ wird so konfiguriert, dass sie den Zugriff auf den Proxy aus anderen Subnetzen erlaubt.\nDiese Option aktivieren, wenn der Zugriff auf den Proxy eines IServs in einer DMZ des Time for kids-Schulrouters aus dem LAN heraus möglich sein soll.

source: E-Mail Address which is shown as Cache Administrator on Squid error pages
de: E-Mail-Adresse, die als Cache Administrator auf Squid-Fehlerseiten angezeigt wird.

source: Cache Peer
de: Eltern-Proxy

source: Proxy server to which all requests are redirected by the IServ Proxy.\nProxy server in format hostname:port
de: Proxyserver, an den alle Anfragen an den IServ-Proxy weitergeleitet werden.\nProxyserver im Format hostname:port

source: Trusted Child Proxies
de: Vertrauenswürdige Kinderproxys

source: Child Proxies where the field 'X-Forwarded-For' is trusted. It will used to detect the origin of a request.
de: Kinderproxys, wo das Feld 'X-Forwarded-For' vertrauenswürdig ist. Es wird genutzt um die Herkunft einer Anfrage zu bestimmen.'
